## [CVS 데이터 파일 다루기]

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd

(2) 데이터 준비 <hr>

- 파일 이름 => 경로 + 파일명
- 경로 => 2가지 종류
    * 절대경로 : 드라이브부터 파일까지의 전체 경로 (ex : C:\Users\data\a.txt)
    * 상대경로 : 현재 파일을 기준으로 경로를 설정
        - ./ : 현재 위치 의미 (예: ./a.txt   현재 파일과 동일한 폴더/위치에 존재)
        - ../ : 한 단계 위로 의미 (예 : ../Data/b.csv => 현재 파일이 존재하는 폴더 밖에 존재하는 파일)

In [3]:
file='./test.txt'

In [10]:
file2='../DATA/movies.csv'

(3) 데이터 저장 CSV => DataFrame

In [11]:
movieDF=pd.read_csv(file2)

(4) 데이터 확인

In [12]:
# 전체적인 데이터 정보 확인 => info() 메서드
movieDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rank    782 non-null    int64
 1   Title   782 non-null    object
 2   Studio  782 non-null    object
 3   Gross   782 non-null    object
 4   Year    782 non-null    int64
dtypes: int64(2), object(3)
memory usage: 30.7+ KB

In [15]:
#실제 저장된 데이터 확인 => head(), tail()
movieDF.head(), movieDF.tail()

(   Rank                         Title       Studio       Gross  Year
 0     1             Avengers: Endgame  Buena Vista  $2,796.30   2019
 1     2                        Avatar          Fox  $2,789.70   2009
 2     3                       Titanic    Paramount  $2,187.50   1997
 3     4  Star Wars: The Force Awakens  Buena Vista  $2,068.20   2015
 4     5        Avengers: Infinity War  Buena Vista  $2,048.40   2018,
      Rank                     Title           Studio     Gross  Year
 777   778                 Yogi Bear  Warner Brothers  $201.60   2010
 778   779       Garfield: The Movie              Fox  $200.80   2004
 779   780               Cats & Dogs  Warner Brothers  $200.70   2001
 780   781  The Hunt for Red October        Paramount  $200.50   1990
 781   782                  Valkyrie              MGM  $200.30   2008)

(5) read_csv 파일 매개변수 살펴보기 <hr>

- header : 파라미터 : DataFrame의 컬럼명 설정하는 파라미터
    * 기본값 : csv 파일의 첫번째 라인의 데이터를 컬럼명으로 설정
    * None : csv 파일의 첫번째 라인이 컬럼명 아님 의미 => 컬럼명 미지정
    * 행번호 : csv 파일의 행번호 라인이 컬럼명으로 설정, 그 이전 행 번호 데이터는 사라짐!

In [18]:
pd.read_csv(file2, header=0) # 아무것도 안하면 제일 첫번째 줄이 컬럼으로 들어간다

     Rank                         Title           Studio       Gross  Year
0       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
1       2                        Avatar              Fox  $2,789.70   2009
2       3                       Titanic        Paramount  $2,187.50   1997
3       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
4       5        Avengers: Infinity War      Buena Vista  $2,048.40   2018
..    ...                           ...              ...         ...   ...
777   778                     Yogi Bear  Warner Brothers    $201.60   2010
778   779           Garfield: The Movie              Fox    $200.80   2004
779   780                   Cats & Dogs  Warner Brothers    $200.70   2001
780   781      The Hunt for Red October        Paramount    $200.50   1990
781   782                      Valkyrie              MGM    $200.30   2008

[782 rows x 5 columns]

In [19]:
pd.read_csv(file2, header=None) # None을 지정하면 제로베이스의 행 인덱스를 부여한다

        0                             1                2           3     4
0    Rank                         Title           Studio       Gross  Year
1       1             Avengers: Endgame      Buena Vista  $2,796.30   2019
2       2                        Avatar              Fox  $2,789.70   2009
3       3                       Titanic        Paramount  $2,187.50   1997
4       4  Star Wars: The Force Awakens      Buena Vista  $2,068.20   2015
..    ...                           ...              ...         ...   ...
778   778                     Yogi Bear  Warner Brothers    $201.60   2010
779   779           Garfield: The Movie              Fox    $200.80   2004
780   780                   Cats & Dogs  Warner Brothers    $200.70   2001
781   781      The Hunt for Red October        Paramount    $200.50   1990
782   782                      Valkyrie              MGM    $200.30   2008

[783 rows x 5 columns]

- index_col 파라미터 : 컬럼 중에서 행 인덱스로 설정, set_index()와 동일 역할

In [21]:
pd.read_csv(file2, index_col=["Studio","Gross"]) # 한 개 넣고 싶으면 index_col="Studio"

                            Rank                         Title  Year
Studio          Gross
Buena Vista     $2,796.30      1             Avengers: Endgame  2019
Fox             $2,789.70      2                        Avatar  2009
Paramount       $2,187.50      3                       Titanic  1997
Buena Vista     $2,068.20      4  Star Wars: The Force Awakens  2015
                $2,048.40      5        Avengers: Infinity War  2018
...                          ...                           ...   ...
Warner Brothers $201.60      778                     Yogi Bear  2010
Fox             $200.80      779           Garfield: The Movie  2004
Warner Brothers $200.70      780                   Cats & Dogs  2001
Paramount       $200.50      781      The Hunt for Red October  1990
MGM             $200.30      782                      Valkyrie  2008

[782 rows x 3 columns]

- sep/ delimiter : CSV 파일에서 데이터 구분자 설정
    * 기본값 : 쉼표(,)

In [26]:
pd.read_csv("./test.txt", sep=";", header=None)

    0   1   2   3
0  10  20  23  30
1  40  50  60  60

- skiprows : csv 파일에 읽어 들이지 않을 행 갯수를 지정하기 => 앞부분
- skiprfooter : csv 파일에 읽어 들이지 않을 행 갯수를 지정하기 => 끝부분

In [32]:
pd.read_csv("./test.txt", sep=";", skiprows=3, header=None, skipfooter=2)

C:\Users\mathn\AppData\Local\Temp\ipykernel_30772\3891686162.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  pd.read_csv("./test.txt", sep=";", skiprows=3, header=None, skipfooter=2)

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [33]:
pd.read_csv("./test.txt", sep=";", skiprows=3, header=None, skipfooter=2, engine='python')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

- usecols : 컬럼에서 특정 컬럼만 선택해서 로딩함
    * usecols=[0, 2, ...] # 리스트 형태로 지정 가능
    * usecols=["컬럼명1","컬럼명2",...] # 컬럼명을 직접 지정하여 사용 가능

In [34]:
pd.read_csv("./test.txt", sep=';', skiprows=3,header=None, usecols=[0,2])

    0   2
0  10  23
1  40  60